# Welcome to Pandas World

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name": ['ramesh', 'laxmi', 'bhuvan', 'shubh'],
    "marks": [92, 98, 98, 96],
    "city": ['Hyderabad', 'Mumbai', 'Rajesthan', 'Assam']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  marks       city
0  ramesh     92  Hyderabad
1   laxmi     98     Mumbai
2  bhuvan     98  Rajesthan
3   shubh     96      Assam

In [6]:
# want to export this data in csv file

In [7]:
df.to_csv('family.csv')

In [8]:
# don't want keys i.e., 0, 1, 2, ...

In [9]:
df.to_csv('family_index.csv', index=False)

In [10]:
# index means row here

In [11]:
# want specific no. of rows

In [12]:
df.head(2)

     name  marks       city
0  ramesh     92  Hyderabad
1   laxmi     98     Mumbai

In [13]:
df.tail(2)

     name  marks       city
2  bhuvan     98  Rajesthan
3   shubh     96      Assam

In [14]:
# describe the numerical column (statistical analysis)

In [15]:
df.describe()

           marks
count   4.000000
mean   96.000000
std     2.828427
min    92.000000
25%    95.000000
50%    97.000000
75%    98.000000
max    98.000000

In [16]:
dict2 = {
    "Train No.": ['1233', '1456', '7812', '9034'],
    "Speed": [123, 345, 567, 789],
    "City": ['Jaipur', 'Raipur', 'Hyderabad', 'Nizamabad']
}

In [17]:
df2 = pd.DataFrame(dict2)

In [18]:
df2

  Train No.  Speed       City
0      1233    123     Jaipur
1      1456    345     Raipur
2      7812    567  Hyderabad
3      9034    789  Nizamabad

In [19]:
df2.to_csv('train_detail.csv', index=False)

In [20]:
df2 = pd.read_csv('train_detail.csv')

In [21]:
df2

   Train No.  Speed       City
0       1233    123     Jaipur
1       1456    345     Raipur
2       7812    567  Hyderabad
3       9034    789  Nizamabad

In [22]:
df2['Speed']

0    123
1    345
2    567
3    789
Name: Speed, dtype: int64

In [23]:
df2['Speed'][2]

567

In [24]:
df2['Speed'][2] = 50

/var/folders/cx/6fm42bl13kxc0txpzrxqkp0m0000gn/T/ipykernel_9283/878134673.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Speed'][2] = 50

In [25]:
df2

   Train No.  Speed       City
0       1233    123     Jaipur
1       1456    345     Raipur
2       7812     50  Hyderabad
3       9034    789  Nizamabad

In [26]:
df2.to_csv('train_detail.csv', index = False)

In [27]:
# want to change the index

In [28]:
df2.index = ['I', 'II', 'III', 'IV']

In [29]:
df2

     Train No.  Speed       City
I         1233    123     Jaipur
II        1456    345     Raipur
III       7812     50  Hyderabad
IV        9034    789  Nizamabad

In [30]:
# to access row we have index, and to access column we have column name

# Series and DataFrame

In [32]:
ser = pd.Series(np.random.rand(34))

In [33]:
ser

0     0.029415
1     0.445294
2     0.347228
3     0.826911
4     0.294198
5     0.815837
6     0.219142
7     0.579826
8     0.896769
9     0.610227
10    0.921470
11    0.558511
12    0.225117
13    0.730199
14    0.310100
15    0.568742
16    0.916981
17    0.486462
18    0.035897
19    0.341398
20    0.756359
21    0.466747
22    0.731639
23    0.813131
24    0.090347
25    0.512317
26    0.366532
27    0.450983
28    0.758811
29    0.245689
30    0.955271
31    0.738798
32    0.034359
33    0.737561
dtype: float64

In [34]:
type(ser)

pandas.core.series.Series

In [35]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [36]:
newdf

            0         1         2         3         4
0    0.882146  0.685744  0.718646  0.472823  0.056659
1    0.445046  0.473095  0.529301  0.998817  0.539899
2    0.289870  0.358754  0.642537  0.584303  0.658858
3    0.449842  0.902752  0.900132  0.587367  0.786077
4    0.095519  0.695115  0.181204  0.182598  0.599283
..        ...       ...       ...       ...       ...
329  0.939899  0.459315  0.987056  0.266177  0.590471
330  0.102026  0.907161  0.646198  0.360035  0.487142
331  0.292785  0.612258  0.918227  0.428272  0.807383
332  0.736915  0.524694  0.741653  0.073751  0.985091
333  0.913930  0.117891  0.766152  0.123394  0.264716

[334 rows x 5 columns]

In [37]:
newdf.head()

          0         1         2         3         4
0  0.882146  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2  0.289870  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [38]:
type(newdf)

pandas.core.frame.DataFrame

In [39]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.526862    0.529738    0.517622    0.495216    0.510486
std      0.285558    0.292298    0.295582    0.280379    0.293920
min      0.003621    0.007134    0.001816    0.004198    0.000113
25%      0.289959    0.285087    0.257824    0.245748    0.259965
50%      0.545329    0.522588    0.523408    0.506907    0.519629
75%      0.770485    0.809212    0.769350    0.708046    0.779698
max      0.998633    0.998908    0.999861    0.998817    0.985091

In [40]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [41]:
newdf[0][0] = "Pavani"

/var/folders/cx/6fm42bl13kxc0txpzrxqkp0m0000gn/T/ipykernel_9283/1299616179.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "Pavani"
/var/folders/cx/6fm42bl13kxc0txpzrxqkp0m0000gn/T/ipykernel_9283/1299616179.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Pavani' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "Pavani"

In [42]:
newdf

            0         1         2         3         4
0      Pavani  0.685744  0.718646  0.472823  0.056659
1    0.445046  0.473095  0.529301  0.998817  0.539899
2     0.28987  0.358754  0.642537  0.584303  0.658858
3    0.449842  0.902752  0.900132  0.587367  0.786077
4    0.095519  0.695115  0.181204  0.182598  0.599283
..        ...       ...       ...       ...       ...
329  0.939899  0.459315  0.987056  0.266177  0.590471
330  0.102026  0.907161  0.646198  0.360035  0.487142
331  0.292785  0.612258  0.918227  0.428272  0.807383
332  0.736915  0.524694  0.741653  0.073751  0.985091
333   0.91393  0.117891  0.766152  0.123394  0.264716

[334 rows x 5 columns]

In [43]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [44]:
newdf.head()

          0         1         2         3         4
0    Pavani  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [45]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [46]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [47]:
newdf.to_numpy()

array([['Pavani', 0.6857442325887444, 0.7186459742968249,
        0.4728233748296552, 0.05665888057629154],
       [0.4450459428256721, 0.47309500482010713, 0.5293011736116858,
        0.9988170875838244, 0.5398993764086153],
       [0.2898704809781546, 0.3587544096711722, 0.6425366866091671,
        0.5843030388850587, 0.6588581270914616],
       ...,
       [0.29278543990679773, 0.6122577035235544, 0.918226992647508,
        0.42827178687382617, 0.807383339896478],
       [0.7369148334744283, 0.5246937566072296, 0.7416528830088183,
        0.07375110913307514, 0.9850905374949608],
       [0.9139296894490935, 0.117891103614151, 0.7661523537561061,
        0.12339373442723822, 0.26471645419281764]], dtype=object)

In [48]:
newdf[0][0] = 334.000000

In [49]:
newdf.head()

          0         1         2         3         4
0     334.0  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [50]:
newdf.to_numpy()

array([[334.0, 0.6857442325887444, 0.7186459742968249,
        0.4728233748296552, 0.05665888057629154],
       [0.4450459428256721, 0.47309500482010713, 0.5293011736116858,
        0.9988170875838244, 0.5398993764086153],
       [0.2898704809781546, 0.3587544096711722, 0.6425366866091671,
        0.5843030388850587, 0.6588581270914616],
       ...,
       [0.29278543990679773, 0.6122577035235544, 0.918226992647508,
        0.42827178687382617, 0.807383339896478],
       [0.7369148334744283, 0.5246937566072296, 0.7416528830088183,
        0.07375110913307514, 0.9850905374949608],
       [0.9139296894490935, 0.117891103614151, 0.7661523537561061,
        0.12339373442723822, 0.26471645419281764]], dtype=object)

In [51]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,334.0,0.445046,0.28987,0.449842,0.095519,0.540634,0.677856,0.216881,0.039725,0.49758,...,0.546548,0.086713,0.620645,0.168633,0.244902,0.939899,0.102026,0.292785,0.736915,0.91393
1,0.685744,0.473095,0.358754,0.902752,0.695115,0.316161,0.875272,0.701791,0.217903,0.314492,...,0.696502,0.438454,0.64482,0.133286,0.797067,0.459315,0.907161,0.612258,0.524694,0.117891
2,0.718646,0.529301,0.642537,0.900132,0.181204,0.389936,0.244058,0.053425,0.136274,0.987587,...,0.368546,0.167581,0.026368,0.245767,0.329925,0.987056,0.646198,0.918227,0.741653,0.766152
3,0.472823,0.998817,0.584303,0.587367,0.182598,0.937718,0.389337,0.259723,0.784907,0.462664,...,0.075416,0.400445,0.020721,0.819282,0.988924,0.266177,0.360035,0.428272,0.073751,0.123394
4,0.056659,0.539899,0.658858,0.786077,0.599283,0.416935,0.652336,0.347473,0.799664,0.79548,...,0.952355,0.926271,0.280823,0.197934,0.865122,0.590471,0.487142,0.807383,0.985091,0.264716

In [52]:
newdf.head()

          0         1         2         3         4
0     334.0  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [53]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333   0.91393  0.117891  0.766152  0.123394  0.264716
332  0.736915  0.524694  0.741653  0.073751  0.985091
331  0.292785  0.612258  0.918227  0.428272  0.807383
330  0.102026  0.907161  0.646198  0.360035  0.487142
329  0.939899  0.459315  0.987056  0.266177  0.590471
..        ...       ...       ...       ...       ...
4    0.095519  0.695115  0.181204  0.182598  0.599283
3    0.449842  0.902752  0.900132  0.587367  0.786077
2     0.28987  0.358754  0.642537  0.584303  0.658858
1    0.445046  0.473095  0.529301  0.998817  0.539899
0       334.0  0.685744  0.718646  0.472823  0.056659

[334 rows x 5 columns]

In [54]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.056659  0.472823  0.718646  0.685744     334.0
1    0.539899  0.998817  0.529301  0.473095  0.445046
2    0.658858  0.584303  0.642537  0.358754   0.28987
3    0.786077  0.587367  0.900132  0.902752  0.449842
4    0.599283  0.182598  0.181204  0.695115  0.095519
..        ...       ...       ...       ...       ...
329  0.590471  0.266177  0.987056  0.459315  0.939899
330  0.487142  0.360035  0.646198  0.907161  0.102026
331  0.807383  0.428272  0.918227  0.612258  0.292785
332  0.985091  0.073751  0.741653  0.524694  0.736915
333  0.264716  0.123394  0.766152  0.117891   0.91393

[334 rows x 5 columns]

In [55]:
newdf.head()

          0         1         2         3         4
0     334.0  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [56]:
newdf[0]

0         334.0
1      0.445046
2       0.28987
3      0.449842
4      0.095519
         ...
329    0.939899
330    0.102026
331    0.292785
332    0.736915
333     0.91393
Name: 0, Length: 334, dtype: object

In [57]:
type(newdf[0])

pandas.core.series.Series

# Copy and View

In [59]:
newdf2 = newdf

In [60]:
# newdf2 is a view

In [61]:
# newdf2 is pointing to newdf

In [62]:
newdf2[0][0] = 9.99

In [63]:
newdf.head()

          0         1         2         3         4
0      9.99  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [64]:
newdf2.head()

          0         1         2         3         4
0      9.99  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [65]:
# copy

In [66]:
newdf3 = newdf.copy()

In [67]:
newdf3[0][0] = 5678

/var/folders/cx/6fm42bl13kxc0txpzrxqkp0m0000gn/T/ipykernel_9283/3147364022.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf3[0][0] = 5678
/var/folders/cx/6fm42bl13kxc0txpzrxqkp0m0000gn/T/ipykernel_9283/3147364022.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0] = 5678

In [68]:
newdf.head()

          0         1         2         3         4
0      9.99  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [69]:
newdf3.head()

          0         1         2         3         4
0      5678  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

# Lock (LOC)

In [71]:
newdf.loc[0, 0] = 12

In [72]:
newdf.head(2)

          0         1         2         3         4
0        12  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899

In [73]:
newdf2.head(2)

          0         1         2         3         4
0        12  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899

In [74]:
newdf3.head(2)

          0         1         2         3         4
0      5678  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899

In [75]:
# if you want columns not in default(i.e., 0, 1, 2...)

In [76]:
newdf.columns = list("ABCDE")

In [77]:
newdf.head()

          A         B         C         D         E
0        12  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [78]:
newdf2.head()

          A         B         C         D         E
0        12  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [79]:
newdf3.head()

          0         1         2         3         4
0      5678  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

In [80]:
newdf.loc[0, 'A'] = 123

In [81]:
newdf.head()

          A         B         C         D         E
0       123  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

# Drop

In [83]:
newdf.loc[0, 0] = 10

In [84]:
newdf.head()

          A         B         C         D         E     0
0       123  0.685744  0.718646  0.472823  0.056659  10.0
1  0.445046  0.473095  0.529301  0.998817  0.539899   NaN
2   0.28987  0.358754  0.642537  0.584303  0.658858   NaN
3  0.449842  0.902752  0.900132  0.587367  0.786077   NaN
4  0.095519  0.695115  0.181204  0.182598  0.599283   NaN

In [85]:
newdf = newdf.drop(0, axis=1)

In [86]:
newdf.head()

          A         B         C         D         E
0       123  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858
3  0.449842  0.902752  0.900132  0.587367  0.786077
4  0.095519  0.695115  0.181204  0.182598  0.599283

# Lock (LOC)

In [88]:
# if you wish to have few specific columns and rows

In [89]:
# it just returing a new DataFrame

In [90]:
newdf.loc[[1,2], ['C','D']]

          C         D
1  0.529301  0.998817
2  0.642537  0.584303

In [91]:
# want all rows

In [92]:
newdf.loc[:, ['C', 'D']]

            C         D
0    0.718646  0.472823
1    0.529301  0.998817
2    0.642537  0.584303
3    0.900132  0.587367
4    0.181204  0.182598
..        ...       ...
329  0.987056  0.266177
330  0.646198  0.360035
331  0.918227  0.428272
332  0.741653  0.073751
333  0.766152  0.123394

[334 rows x 2 columns]

In [93]:
# want all columns

In [94]:
newdf.loc[[1, 2], :]

          A         B         C         D         E
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858

In [95]:
# complex queries

In [96]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D         E
2     0.28987  0.358754  0.642537  0.584303  0.658858
4    0.095519  0.695115  0.181204  0.182598  0.599283
7    0.216881  0.701791  0.053425  0.259723  0.347473
8    0.039725  0.217903  0.136274  0.784907  0.799664
15   0.022699  0.796924  0.108585  0.250526  0.075091
..        ...       ...       ...       ...       ...
325  0.086713  0.438454  0.167581  0.400445  0.926271
327  0.168633  0.133286  0.245767  0.819282  0.197934
328  0.244902  0.797067  0.329925  0.988924  0.865122
330  0.102026  0.907161  0.646198  0.360035  0.487142
331  0.292785  0.612258  0.918227  0.428272  0.807383

[91 rows x 5 columns]

In [97]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
2     0.28987  0.358754  0.642537  0.584303  0.658858
4    0.095519  0.695115  0.181204  0.182598  0.599283
8    0.039725  0.217903  0.136274  0.784907  0.799664
15   0.022699  0.796924  0.108585  0.250526  0.075091
20   0.091863  0.172400  0.181769  0.116651  0.119937
..        ...       ...       ...       ...       ...
325  0.086713  0.438454  0.167581  0.400445  0.926271
327  0.168633  0.133286  0.245767  0.819282  0.197934
328  0.244902  0.797067  0.329925  0.988924  0.865122
330  0.102026  0.907161  0.646198  0.360035  0.487142
331  0.292785  0.612258  0.918227  0.428272  0.807383

[87 rows x 5 columns]

# ILOC

In [99]:
newdf.head(2)

          A         B         C         D         E
0       123  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899

In [100]:
newdf.iloc[0,2]

0.7186459742968249

In [101]:
newdf.iloc[0,4]

0.05665888057629154

In [102]:
newdf.iloc[[0, 5],[1, 2]]

          B         C
0  0.685744  0.718646
5  0.316161  0.389936

In [103]:
# wanna drop one row

In [104]:
newdf.head(3)

          A         B         C         D         E
0       123  0.685744  0.718646  0.472823  0.056659
1  0.445046  0.473095  0.529301  0.998817  0.539899
2   0.28987  0.358754  0.642537  0.584303  0.658858

In [105]:
newdf.drop([0])

            A         B         C         D         E
1    0.445046  0.473095  0.529301  0.998817  0.539899
2     0.28987  0.358754  0.642537  0.584303  0.658858
3    0.449842  0.902752  0.900132  0.587367  0.786077
4    0.095519  0.695115  0.181204  0.182598  0.599283
5    0.540634  0.316161  0.389936  0.937718  0.416935
..        ...       ...       ...       ...       ...
329  0.939899  0.459315  0.987056  0.266177  0.590471
330  0.102026  0.907161  0.646198  0.360035  0.487142
331  0.292785  0.612258  0.918227  0.428272  0.807383
332  0.736915  0.524694  0.741653  0.073751  0.985091
333   0.91393  0.117891  0.766152  0.123394  0.264716

[333 rows x 5 columns]

In [106]:
newdf.drop(['A', 'C'], axis=1)

            B         D         E
0    0.685744  0.472823  0.056659
1    0.473095  0.998817  0.539899
2    0.358754  0.584303  0.658858
3    0.902752  0.587367  0.786077
4    0.695115  0.182598  0.599283
..        ...       ...       ...
329  0.459315  0.266177  0.590471
330  0.907161  0.360035  0.487142
331  0.612258  0.428272  0.807383
332  0.524694  0.073751  0.985091
333  0.117891  0.123394  0.264716

[334 rows x 3 columns]

In [107]:
newdf

            A         B         C         D         E
0         123  0.685744  0.718646  0.472823  0.056659
1    0.445046  0.473095  0.529301  0.998817  0.539899
2     0.28987  0.358754  0.642537  0.584303  0.658858
3    0.449842  0.902752  0.900132  0.587367  0.786077
4    0.095519  0.695115  0.181204  0.182598  0.599283
..        ...       ...       ...       ...       ...
329  0.939899  0.459315  0.987056  0.266177  0.590471
330  0.102026  0.907161  0.646198  0.360035  0.487142
331  0.292785  0.612258  0.918227  0.428272  0.807383
332  0.736915  0.524694  0.741653  0.073751  0.985091
333   0.91393  0.117891  0.766152  0.123394  0.264716

[334 rows x 5 columns]

In [108]:
newdf.drop(['A', 'D'], axis=1, inplace=True)

In [109]:
newdf.head()

          B         C         E
0  0.685744  0.718646  0.056659
1  0.473095  0.529301  0.539899
2  0.358754  0.642537  0.658858
3  0.902752  0.900132  0.786077
4  0.695115  0.181204  0.599283

In [110]:
newdf.drop([1, 5], axis=0, inplace=True)

In [111]:
newdf.head()

          B         C         E
0  0.685744  0.718646  0.056659
2  0.358754  0.642537  0.658858
3  0.902752  0.900132  0.786077
4  0.695115  0.181204  0.599283
6  0.875272  0.244058  0.652336

In [112]:
# want to reset index

In [113]:
newdf.reset_index().head()

   index         B         C         E
0      0  0.685744  0.718646  0.056659
1      2  0.358754  0.642537  0.658858
2      3  0.902752  0.900132  0.786077
3      4  0.695115  0.181204  0.599283
4      6  0.875272  0.244058  0.652336

In [114]:
newdf.reset_index(drop=True, inplace=True)

In [115]:
newdf.head()

          B         C         E
0  0.685744  0.718646  0.056659
1  0.358754  0.642537  0.658858
2  0.902752  0.900132  0.786077
3  0.695115  0.181204  0.599283
4  0.875272  0.244058  0.652336

# Null Concept

In [117]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [118]:
# Bad practice of assigning null, use .loc

In [119]:
# newdf['B'] = None

In [120]:
# newdf['B'].isnull()

In [121]:
newdf.loc[:, ['B']] = 34

In [122]:
newdf.head()

      B         C         E
0  34.0  0.718646  0.056659
1  34.0  0.642537  0.658858
2  34.0  0.900132  0.786077
3  34.0  0.181204  0.599283
4  34.0  0.244058  0.652336

In [123]:
df = pd.DataFrame({
    "name": ['Alfred', 'Batman', 'Catwoman'],
    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]
})

In [124]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [125]:
# drop none

In [126]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [127]:
# how = 'all' => if all column or row is NaN

In [128]:
df.dropna(how = 'all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [129]:
# how = 'any' => if any of the column or row is NaN

In [130]:
df.dropna(how = 'any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [131]:
# lets demo how => all

In [132]:
df = pd.DataFrame({
    "name": ['Alfred', 'Batman', 'Catwoman'],
    "toy": [np.nan, np.nan, np.nan],
    "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]
})

In [259]:
df.dropna(how='all', axis=1)

       name       born
0    Alfred        NaT
1    Batman 1940-04-25
2  Catwoman        NaT

In [ ]:
# drop duplicates

In [261]:
dff1 = pd.DataFrame({
    "name": ['Alfred', 'Batman', 'Alfred'],
    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]
})

In [290]:
dff1

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [267]:
dff1.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [269]:
# keep => first or last

In [271]:
dff1.drop_duplicates(subset=['name'], keep='last')

     name        toy       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [273]:
dff1.drop_duplicates(subset=['name'], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

# how to inspect dataset

In [292]:
dff1

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [278]:
dff1.shape

(3, 3)

In [286]:
dff1.info

<bound method DataFrame.info of      name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT>

In [282]:
# unique values count

In [288]:
dff1['name'].value_counts(dropna=False)

name
Alfred    2
Batman    1
Name: count, dtype: int64

In [294]:
dff1['toy'].value_counts(dropna=False)

toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [296]:
dff1['toy'].value_counts(dropna=True)

toy
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [298]:
dff1.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [300]:
dff1.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

# Question

**create a dataframe which contains only integers with 3 rows and 2 columns**

**And run the following dataframe methods on them:**

In [328]:
pav = pd.DataFrame({
    "count": [1, -2, 3, 4],
    "number": [5, 6, 7, 8]
})

In [330]:
pav

   count  number
0      1       5
1     -2       6
2      3       7
3      4       8

In [332]:
pav.describe()

          count    number
count  4.000000  4.000000
mean   1.500000  6.500000
std    2.645751  1.290994
min   -2.000000  5.000000
25%    0.250000  5.750000
50%    2.000000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000

In [334]:
pav.mean()

count     1.5
number    6.5
dtype: float64

In [336]:
pav.corr()

          count   number
count   1.00000  0.68313
number  0.68313  1.00000

In [338]:
pav.count()

count     4
number    4
dtype: int64

In [340]:
pav.max()

count     4
number    8
dtype: int64

In [342]:
pav.min()

count    -2
number    5
dtype: int64

In [344]:
pav.median()

count     2.0
number    6.5
dtype: float64

In [348]:
pav.std()

count     2.645751
number    1.290994
dtype: float64

# How to handel excel sheet using pandas

In [398]:
data = pd.read_excel('data.xlsx', sheet_name='Sheet 2')

In [400]:
data

      Table 1 Unnamed: 1 Unnamed: 2
0  train no.2     Speed2      City2
1         234        458  Bangalore
2         766        789  Hyderabad
3         112        231     Mumbai
4         991        344  Rajesthan

In [402]:
# to_excel

In [418]:
data.iloc[1, 0] = 34

In [420]:
data

      Table 1 Unnamed: 1 Unnamed: 2
0  train no.2     Speed2      City2
1          34         34  Bangalore
2         766        789  Hyderabad
3         112        231     Mumbai
4         991        344  Rajesthan

In [422]:
# write on that excel sheet

In [332]:
data.to_excel('data.xlsx', sheet_name='Sheet 2')

In [334]:
data

   Unnamed: 0.1  Unnamed: 0     Table 1 Unnamed: 1 Unnamed: 2
0             0           0  train no.2     Speed2      City2
1            34          34          34         34  Bangalore
2             2           2         766        789  Hyderabad
3             3           3         112        231     Mumbai
4             4           4         991        344  Rajesthan